# GetUpdaterId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IUpdater..::..GetUpdaterId Method
IUpdater Interface See Also
---
Returns globally unique updater id - used to identify the Updater Called once during registration of the updater
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
UpdaterId GetUpdaterId()
```

Visual Basic
---
```text
Function GetUpdaterId As UpdaterId
```

Visual C++
---
```text
UpdaterId^ GetUpdaterId()
```

# See Also
IUpdater Interface
Autodesk.Revit.DB Namespace